app/Database/Seeds/BacaYukSeeder.php

INSERT INTO `lencana` (`nama`, `deskripsi`, `ikon`, `syarat_tipe`, `syarat_nilai`, `created_at`, `updated_at`) VALUES ('Langkah Pertama', 'Mengisi jurnal membaca pertama kali', '🌱', 'total_jurnal', 1, '2026-10-09 11:41:14', '2026-10-09 11:41:14')
INSERT INTO `kelas` (`nama`, `tingkat`, `tahun_ajaran`, `created_at`, `updated_at`) VALUES ('4A', 4, '2026/2027', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
INSERT INTO `users` (`nama`, `username`, `email`, `password_hash`, `role`, `avatar`, `created_at`, `updated_at`) VALUES ('Admin BacaYuk', 'admin', 'admin@bacayuk.sch.id', '$2y$12$8tmSjSB/edMri/O6TZUJUeEBvMnudEBDXLd5N3iPxihOql6XVsw16', 'admin', '🦉', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
INSERT INTO `users` (`nama`, `username`, `email`, `password_hash`, `role`, `kelas_id`, `avatar`, `created_at`, `updated_at`) VALUES ('Rizki Pratama', 'guru', 'guru@bacayuk.sch.id', '$2y$12$RyhLUyuT4PLktqlOB6mI3./.zYLmF.6.cA.P7ySZkRFDoiEgMiq12', 'guru', 1, '🦁', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
UPDATE `kelas` SET `guru_id` = 2
WHERE `id` = 1
---
    public function run()
    {
        $now = date('Y-m-d H:i:s');
        $hash = static fn (string $pw) => password_hash($pw, PASSWORD_DEFAULT);

        // ---------- Lencana ----------
        $lencana = [
            ['nama' => 'Langkah Pertama',   'deskripsi' => 'Mengisi jurnal membaca pertama kali', 'ikon' => '🌱', 'syarat_tipe' => 'total_jurnal',  'syarat_nilai' => 1],
            ['nama' => 'Pembaca Rajin',     'deskripsi' => 'Mengisi 10 jurnal membaca',           'ikon' => '📖', 'syarat_tipe' => 'total_jurnal',  'syarat_nilai' => 10],
            ['nama' => 'Kutu Buku',         'deskripsi' => 'Menyelesaikan 5 buku',                'ikon' => '🐛', 'syarat_tipe' => 'total_buku',    'syarat_nilai' => 5],
            ['nama' => 'Penjelajah Cerita', 'deskripsi' => 'Menyelesaikan 10 buku',               'ikon' => '🧭', 'syarat_tipe' => 'total_buku',    'syarat_nilai' => 10],
            ['nama' => 'Pemburu Halaman',   'deskripsi' => 'Membaca total 500 halaman',           'ikon' => '🎯', 'syarat_tipe' => 'total_halaman', 'syarat_nilai' => 500],
            ['nama' => 'Maraton Baca',      'deskripsi' => 'Membaca total 300 menit',             'ikon' => '🏃', 'syarat_tipe' => 'total_menit',   'syarat_nilai' => 300],
            ['nama' => 'Bintang 7 Hari',    'deskripsi' => 'Membaca 7 hari berturut-turut',       'ikon' => '⭐', 'syarat_tipe' => 'streak',        'syarat_nilai' => 7],
            ['nama' => 'Konsisten Sebulan', 'deskripsi' => 'Mengisi 30 jurnal membaca',           'ikon' => '🏆', 'syarat_tipe' => 'total_jurnal',  'syarat_nilai' => 30],
        ];
        foreach ($lencana as $l) {
            $this->db->table('lencana')->insert($l + ['created_at' => $now, 'updated_at' => $now]);
        }

        // ---------- Kelas ----------
        $this->db->table('kelas')->insert([
            'nama' => '4A', 'tingkat' => 4, 'tahun_ajaran' => '2026/2027',
            'created_at' => $now, 'updated_at' => $now,
        ]);
        $kelasId = (int) $this->db->insertID();

        // ---------- Users ----------
        $this->db->table('users')->insert([
            'nama' => 'Admin BacaYuk', 'username' => 'admin', 'email' => 'admin@bacayuk.sch.id',
            'password_hash' => $hash('admin123'), 'role' => 'admin', 'avatar' => '🦉',
            'created_at' => $now, 'updated_at' => $now,
        ]);

        $this->db->table('users')->insert([
            'nama' => 'Rizki Pratama', 'username' => 'guru', 'email' => 'guru@bacayuk.sch.id',
            'password_hash' => $hash('guru123'), 'role' => 'guru', 'kelas_id' => $kelasId, 'avatar' => '🦁',
            'created_at' => $now, 'updated_at' => $now,
        ]);
        $guruId = (int) $this->db->insertID();
        $this->db->table('kelas')->where('id', $kelasId)->update(['guru_id' => $guruId]);

INSERT INTO `users` (`nama`, `username`, `password_hash`, `role`, `kelas_id`, `avatar`, `created_at`, `updated_at`) VALUES ('Aisyah Putri', 'siswa', '$2y$12$/0ISLq6yqAnUYQ2FUTHFg.PLfEZQaaLM1Iv726FBYgiltrngjBwQ.', 'siswa', 1, '🦊', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
---
        ];
        $siswaIds = [];
        foreach ($siswaData as [$nama, $username, $avatar]) {
            $this->db->table('users')->insert([
                'nama' => $nama, 'username' => $username,
                'password_hash' => $hash('siswa123'), 'role' => 'siswa',
                'kelas_id' => $kelasId, 'avatar' => $avatar,
                'created_at' => $now, 'updated_at' => $now,
            ]);

INSERT INTO `buku` (`judul`, `penulis`, `genre`, `jumlah_halaman`, `warna_sampul`, `ikon`, `ditambah_oleh`, `created_at`, `updated_at`) VALUES ('Si Kancil Anak Cerdik', 'Dewi Nastiti', 'Dongeng', 48, '#FF7BAC', '🦌', 2, '2026-10-09 11:41:14', '2026-10-09 11:41:14')
---
        ];
        $bukuIds = [];
        foreach ($bukuData as [$judul, $penulis, $genre, $hal, $warna, $ikon]) {
            $this->db->table('buku')->insert([
                'judul' => $judul, 'penulis' => $penulis, 'genre' => $genre,
                'jumlah_halaman' => $hal, 'warna_sampul' => $warna, 'ikon' => $ikon,
                'ditambah_oleh' => $guruId, 'created_at' => $now, 'updated_at' => $now,
            ]);

INSERT INTO `jurnal_baca` (`siswa_id`, `buku_id`, `judul_buku`, `tanggal`, `halaman_dari`, `halaman_sampai`, `jumlah_halaman`, `durasi_menit`, `ringkasan`, `pesan_cerita`, `rating`, `perasaan`, `status`, `catatan_guru`, `diverifikasi_oleh`, `diverifikasi_pada`, `created_at`, `updated_at`) VALUES (3, 1, 'Si Kancil Anak Cerdik', '2026-10-03', 1, 16, 16, 26, 'Aku belajar hal baru hari ini. Gambarnya juga bagus.', 'Kita harus rajin dan baik hati kepada semua orang.', 4, '😄', 'terverifikasi', 'Bagus sekali, lanjutkan! 🌟', 2, '2026-10-09 11:41:14', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
---
        ];
        for ($d = 6; $d >= 0; $d--) {
            $bukuIdx = 6 - $d;
            $this->db->table('jurnal_baca')->insert([
                'siswa_id' => $siswaIds['siswa'], 'buku_id' => $bukuIds[$bukuIdx % 6],
                'judul_buku' => $bukuData[$bukuIdx % 6][0],
                'tanggal' => date('Y-m-d', strtotime("-{$d} days")),
                'halaman_dari' => 1 + (6 - $d) * 8, 'halaman_sampai' => 16 + (6 - $d) * 8,
                'jumlah_halaman' => 16, 'durasi_menit' => 20 + $d,
                'ringkasan' => $ringkasan[$d % 5],
                'pesan_cerita' => 'Kita harus rajin dan baik hati kepada semua orang.',
                'rating' => 4 + ($d % 2), 'perasaan' => ['😊', '🤩', '😄', '🥰', '😊', '🤩', '😄'][$d],
                'status' => 'terverifikasi', 'catatan_guru' => 'Bagus sekali, lanjutkan! 🌟',
                'diverifikasi_oleh' => $guruId, 'diverifikasi_pada' => $now,
                'created_at' => $now, 'updated_at' => $now,
            ]);

INSERT INTO `jurnal_baca` (`siswa_id`, `buku_id`, `judul_buku`, `tanggal`, `halaman_dari`, `halaman_sampai`, `jumlah_halaman`, `durasi_menit`, `ringkasan`, `pesan_cerita`, `rating`, `perasaan`, `status`, `catatan_guru`, `diverifikasi_oleh`, `diverifikasi_pada`, `created_at`, `updated_at`) VALUES (4, 1, 'Si Kancil Anak Cerdik', '2026-10-04', 1, 10, 10, 15, 'Ceritanya seru! Tokohnya pintar dan suka menolong teman.', 'Banyak pelajaran baik dari cerita ini.', 3, '😊', 'terverifikasi', 'Hebat! Terus semangat ya.', 2, '2026-10-09 11:41:14', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
---
        ];
        foreach ($pola as $username => $hariList) {
            foreach ($hariList as $i => $d) {
                $this->db->table('jurnal_baca')->insert([
                    'siswa_id' => $siswaIds[$username], 'buku_id' => $bukuIds[$i % 6],
                    'judul_buku' => $bukuData[$i % 6][0],
                    'tanggal' => date('Y-m-d', strtotime("-{$d} days")),
                    'halaman_dari' => 1, 'halaman_sampai' => 10 + $i * 3,
                    'jumlah_halaman' => 10 + $i * 3, 'durasi_menit' => 15 + $i * 5,
                    'ringkasan' => $ringkasan[($i + $d) % 5],
                    'pesan_cerita' => 'Banyak pelajaran baik dari cerita ini.',
                    'rating' => 3 + ($i % 3), 'perasaan' => '😊',
                    'status' => 'terverifikasi', 'catatan_guru' => 'Hebat! Terus semangat ya.',
                    'diverifikasi_oleh' => $guruId, 'diverifikasi_pada' => $now,
                    'created_at' => $now, 'updated_at' => $now,
                ]);

INSERT INTO `jurnal_baca` (`siswa_id`, `buku_id`, `judul_buku`, `tanggal`, `halaman_dari`, `halaman_sampai`, `jumlah_halaman`, `durasi_menit`, `ringkasan`, `pesan_cerita`, `rating`, `perasaan`, `status`, `created_at`, `updated_at`) VALUES (4, 1, 'Si Kancil Anak Cerdik', '2026-10-09', 17, 28, 12, 18, 'Ceritanya seru! Tokohnya pintar dan suka menolong teman.', 'Tidak boleh menyerah sebelum mencoba.', 5, '🤩', 'menunggu', '2026-10-09 11:41:14', '2026-10-09 11:41:14')
---

        // 2 jurnal MENUNGGU verifikasi (untuk demo guru)
        foreach (['bima', 'citra'] as $i => $username) {
            $this->db->table('jurnal_baca')->insert([
                'siswa_id' => $siswaIds[$username], 'buku_id' => $bukuIds[$i],
                'judul_buku' => $bukuData[$i][0],
                'tanggal' => date('Y-m-d'),
                'halaman_dari' => 17, 'halaman_sampai' => 28, 'jumlah_halaman' => 12,
                'durasi_menit' => 18, 'ringkasan' => $ringkasan[$i],
                'pesan_cerita' => 'Tidak boleh menyerah sebelum mencoba.',
                'rating' => 5, 'perasaan' => '🤩', 'status' => 'menunggu',
                'created_at' => $now, 'updated_at' => $now,
            ]);