app/Controllers/Admin.php

    public function dashboard()
    {
        $db = \Config\Database::connect();
        return view('admin/dashboard', [
            'judul' => 'Dashboard Admin',
            'ringkas' => [
                'users'   => model(UserModel::class)->countAllResults(),
                'guru'    => model(UserModel::class)->where('role', 'guru')->countAllResults(),
                'siswa'   => model(UserModel::class)->where('role', 'siswa')->countAllResults(),
                'kelas'   => model(KelasModel::class)->countAllResults(),
                'buku'    => model(BukuModel::class)->countAllResults(),
                'jurnal'  => model(JurnalModel::class)->countAllResults(),
                'menunggu' => model(JurnalModel::class)->where('status', 'menunggu')->countAllResults(),
                'lencana' => model(LencanaModel::class)->countAllResults(),
            ],
            'kelas' => model(KelasModel::class)->denganGuru(),
            'aktivitas' => $db->table('jurnal_baca j')
                ->select('j.*, u.nama AS nama_siswa')
                ->join('users u', 'u.id = j.siswa_id')
                ->orderBy('j.id', 'DESC')->limit(8)->get()->getResultArray(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'guru'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'siswa'
SELECT COUNT(*) AS `numrows`
FROM `kelas`
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `lencana`
SELECT `j`.*, `u`.`nama` AS `nama_siswa`
FROM `jurnal_baca` `j`
JOIN `users` `u` ON `u`.`id` = `j`.`siswa_id`
ORDER BY `j`.`id` DESC
 LIMIT 8

    public function users()
    {
        $users = model(UserModel::class)
            ->select('users.*, kelas.nama AS nama_kelas')
            ->join('kelas', 'kelas.id = users.kelas_id', 'left')
            ->orderBy('users.role', 'ASC')->orderBy('users.nama', 'ASC')
            ->findAll();
---
SELECT `users`.*, `kelas`.`nama` AS `nama_kelas`
FROM `users`
LEFT JOIN `kelas` ON `kelas`.`id` = `users`.`kelas_id`
ORDER BY `users`.`role` ASC, `users`.`nama` ASC

    public function userBaru()
    {
        return view('admin/user_form', [
            'judul' => 'Tambah User', 'user' => null,
            'kelas' => model(KelasModel::class)->orderBy('tingkat')->orderBy('nama')->findAll(),
---
SELECT *
FROM `kelas`
ORDER BY `tingkat`, `nama`

    public function userSimpan()
    {
        $rules = [
            'nama'     => 'required|max_length[100]',
            'username' => 'required|max_length[50]|is_unique[users.username]',
            'password' => 'required|min_length[6]',
            'role'     => 'required|in_list[admin,guru,siswa]',
            'email'    => 'permit_empty|valid_email|max_length[100]',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }
        model(UserModel::class)->insert([
            'nama'          => trim((string) $this->request->getPost('nama')),
            'username'      => trim((string) $this->request->getPost('username')),
            'email'         => trim((string) $this->request->getPost('email')) ?: null,
            'password_hash' => password_hash((string) $this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'          => $this->request->getPost('role'),
            'kelas_id'      => $this->request->getPost('kelas_id') ?: null,
            'avatar'        => $this->request->getPost('avatar') ?: '🦊',
            'is_active'     => 1,
        ]);
---
INSERT INTO `users` (`nama`, `username`, `email`, `password_hash`, `role`, `kelas_id`, `avatar`, `is_active`, `created_at`, `updated_at`) VALUES ('Siswa Uji', 'uji', NULL, '$2y$12$h1z9V3m/FiGzhVZAQ9T4m.y0h867srqGcnx1qAwpHNLgV62ItTg22', 'siswa', '1', '🦊', 1, '2026-10-09 11:16:58', '2026-10-09 11:16:58')

    public function kelasBaru()
    {
        return view('admin/kelas_form', [
            'judul' => 'Tambah Kelas', 'kelas' => null,
            'guru'  => model(UserModel::class)->where('role', 'guru')->orderBy('nama')->findAll(),
---
SELECT *
FROM `users`
WHERE `role` = 'guru'
ORDER BY `nama`

    public function kelasSimpan()
    {
        $data = $this->olahKelas();
        if (! is_array($data)) {
            return $data;
        }
        $id = model(KelasModel::class)->insert($data);
---
INSERT INTO `kelas` (`nama`, `tingkat`, `tahun_ajaran`, `guru_id`, `created_at`, `updated_at`) VALUES ('4B', 4, '2026/2027', NULL, '2026-10-09 11:16:58', '2026-10-09 11:16:58')

    public function jurnal()
    {
        $daftar = model(JurnalModel::class)
            ->select('jurnal_baca.*, users.nama AS nama_siswa, users.avatar, kelas.nama AS nama_kelas')
            ->join('users', 'users.id = jurnal_baca.siswa_id')
            ->join('kelas', 'kelas.id = users.kelas_id', 'left')
            ->orderBy('jurnal_baca.tanggal', 'DESC')
            ->findAll(100);
---
SELECT `jurnal_baca`.*, `users`.`nama` AS `nama_siswa`, `users`.`avatar`, `kelas`.`nama` AS `nama_kelas`
FROM `jurnal_baca`
JOIN `users` ON `users`.`id` = `jurnal_baca`.`siswa_id`
LEFT JOIN `kelas` ON `kelas`.`id` = `users`.`kelas_id`
ORDER BY `jurnal_baca`.`tanggal` DESC
 LIMIT 100

    public function lencana()
    {
        return view('admin/lencana', [
            'judul'   => 'Definisi Lencana',
            'lencana' => model(LencanaModel::class)->orderBy('syarat_tipe')->orderBy('syarat_nilai')->findAll(),
---
SELECT *
FROM `lencana`
ORDER BY `syarat_tipe`, `syarat_nilai`