app/Controllers/Buku.php

    public function index()
    {
        return view('buku/index', [
            'judul' => 'Kelola Katalog Buku',
            'buku'  => $this->buku->orderBy('judul', 'ASC')->findAll(),
---
SELECT *
FROM `buku`
ORDER BY `judul` ASC