app/Controllers/Guru.php

SELECT COUNT(*) AS `numrows`
FROM `jurnal_baca` `j`
JOIN `users` `u` ON `u`.`id` = `j`.`siswa_id`
WHERE `u`.`kelas_id` = 1
AND `j`.`tanggal` >= '2026-10-03'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'siswa'
AND `kelas_id` = 1
---
    public function dashboard()
    {
        $kelasId = $this->kelasSaya();
        if ($kelasId === null) {
            return view('guru/dashboard', [
                'judul' => 'Dashboard Guru', 'tanpaKelas' => true,
                'menunggu' => [], 'belum' => [], 'grafik' => ['labels' => [], 'menit' => []],
                'ringkas' => ['siswa' => 0, 'jurnal_minggu' => 0, 'menunggu' => 0],
            ]);
        }

        $db       = \Config\Database::connect();
        $mingguIni = $db->table('jurnal_baca j')
            ->join('users u', 'u.id = j.siswa_id')
            ->where('u.kelas_id', $kelasId)
            ->where('j.tanggal >=', date('Y-m-d', strtotime('-6 days')))
            ->countAllResults();

        $menunggu = $this->jurnal->menungguDiKelas($kelasId);

        return view('guru/dashboard', [
            'judul'    => 'Dashboard Guru',
            'tanpaKelas' => false,
            'menunggu' => array_slice($menunggu, 0, 5),
            'belum'    => $this->jurnal->belumMembacaMingguIni($kelasId),
            'grafik'   => $this->jurnal->grafikKelas7Hari($kelasId),
            'ringkas'  => [
                'siswa'         => model(UserModel::class)->where('role', 'siswa')->where('kelas_id', $kelasId)->countAllResults(),
                'jurnal_minggu' => $mingguIni,
                'menunggu'      => count($menunggu),
            ],

UPDATE `jurnal_baca` SET `status` = 'terverifikasi', `catatan_guru` = 'Kerja bagus!', `diverifikasi_oleh` = 2, `diverifikasi_pada` = '2026-10-09 11:16:57', `updated_at` = '2026-10-09 11:16:57'
WHERE `jurnal_baca`.`id` IN (23)
---
    public function verifikasiSimpan(int $id)
    {
        $kelasId = $this->kelasSaya();
        $j = $this->jurnal->select('jurnal_baca.*, users.kelas_id')
            ->join('users', 'users.id = jurnal_baca.siswa_id')
            ->where('jurnal_baca.id', $id)->first();

        if ($j === null || $kelasId === null || (int) $j['kelas_id'] !== $kelasId || $j['status'] !== 'menunggu') {
            return redirect()->to('/guru/verifikasi')->with('error', 'Jurnal tidak ditemukan / sudah diproses.');
        }

        $status = $this->request->getPost('status');
        if (! in_array($status, ['terverifikasi', 'revisi'], true)) {
            return redirect()->back()->with('error', 'Pilih status verifikasi dulu ya.');
        }

        $this->jurnal->update($id, [
            'status'            => $status,
            'catatan_guru'      => trim((string) $this->request->getPost('catatan_guru')) ?: null,
            'diverifikasi_oleh' => session()->get('user_id'),
            'diverifikasi_pada' => date('Y-m-d H:i:s'),
        ]);

SELECT `jurnal_baca`.*, `users`.`nama` AS `nama_siswa`, `users`.`avatar`
FROM `jurnal_baca`
JOIN `users` ON `users`.`id` = `jurnal_baca`.`siswa_id`
WHERE `users`.`kelas_id` = 1
ORDER BY `jurnal_baca`.`tanggal` DESC
 LIMIT 100
---
    public function semuaJurnal()
    {
        $kelasId = $this->kelasSaya();
        $daftar  = [];
        if ($kelasId !== null) {
            $daftar = $this->jurnal->select('jurnal_baca.*, users.nama AS nama_siswa, users.avatar')
                ->join('users', 'users.id = jurnal_baca.siswa_id')
                ->where('users.kelas_id', $kelasId)
                ->orderBy('jurnal_baca.tanggal', 'DESC')
                ->findAll(100);