app/Controllers/Siswa.php

    public function dashboard()
    {
        $id    = $this->saya();
        $stats = $this->jurnal->statistikSiswa($id);

        $lanjut = $this->jurnal->select('jurnal_baca.*, buku.jumlah_halaman AS total_halaman_buku')
            ->join('buku', 'buku.id = jurnal_baca.buku_id', 'left')
            ->where('siswa_id', $id)
            ->orderBy('tanggal', 'DESC')
            ->findAll(5);
---
SELECT `jurnal_baca`.*, `buku`.`jumlah_halaman` AS `total_halaman_buku`
FROM `jurnal_baca`
LEFT JOIN `buku` ON `buku`.`id` = `jurnal_baca`.`buku_id`
WHERE `siswa_id` = 3
ORDER BY `tanggal` DESC
 LIMIT 5

    public function jurnalBaru()
    {
        return view('siswa/jurnal_form', [
            'judul' => 'Isi Jurnal Baru',
            'buku'  => model(BukuModel::class)->orderBy('judul', 'ASC')->findAll(),
---
SELECT *
FROM `buku`
ORDER BY `judul` ASC

    public function buku()
    {
        $genre = $this->request->getGet('genre');
        $m     = model(BukuModel::class);
        if ($genre && in_array($genre, BukuModel::GENRE, true)) {
            $m = $m->where('genre', $genre);
        }
        return view('siswa/buku', [
            'judul' => 'Katalog Buku',
            'buku'  => $m->orderBy('judul', 'ASC')->findAll(),
---
SELECT *
FROM `buku`
ORDER BY `judul` ASC

    public function lencana()
    {
        $id     = $this->saya();
        $stats  = $this->jurnal->statistikSiswa($id);
        $semua  = model(LencanaModel::class)->orderBy('syarat_nilai', 'ASC')->findAll();
---
SELECT *
FROM `lencana`
ORDER BY `syarat_nilai` ASC