app/Controllers/Siswa.php

SELECT *
FROM `jurnal_baca`
WHERE `siswa_id` = 3
ORDER BY `tanggal` DESC, `id` DESC
---
    public function dashboard()
    {
        $id    = $this->saya();
        $stats = $this->jurnal->statistikSiswa($id);

        $lanjut = $this->jurnal->select('jurnal_baca.*, buku.jumlah_halaman AS total_halaman_buku')
            ->join('buku', 'buku.id = jurnal_baca.buku_id', 'left')
            ->where('siswa_id', $id)
            ->orderBy('tanggal', 'DESC')
            ->findAll(5);

        $seringDibaca = $this->jurnal->select('jurnal_baca.judul_buku, COUNT(*) AS dibaca, buku.warna_sampul AS warna, buku.ikon, buku.penulis, buku.sampul_url')
            ->join('buku', 'buku.judul = jurnal_baca.judul_buku', 'left')
            ->where('jurnal_baca.status', 'terverifikasi')
            ->groupBy('jurnal_baca.judul_buku, buku.warna_sampul, buku.ikon, buku.penulis, buku.sampul_url')
            ->orderBy('dibaca', 'DESC')
            ->findAll(3);

        return view('siswa/dashboard', [
            'judul'       => 'Dashboard',
            'stats'       => $stats,
            'grafik'      => $this->jurnal->grafik7Hari($id),
            'lanjut'      => $lanjut,
            'lencana'     => model(UserLencanaModel::class)->milikUser($id),
            'bukuTerbaru' => model(BukuModel::class)->orderBy('id', 'DESC')->findAll(6),