app/Models/JurnalModel.php

    public function grafikKelas7Hari(int $kelasId): array
    {
        $labels = [];
        $menit  = [];
        $namaHari = [1 => 'Sen', 2 => 'Sel', 3 => 'Rab', 4 => 'Kam', 5 => 'Jum', 6 => 'Sab', 7 => 'Min'];
        $db = \Config\Database::connect();

        for ($i = 6; $i >= 0; $i--) {
            $tgl      = date('Y-m-d', strtotime("-{$i} days"));
            $labels[] = $namaHari[(int) date('N', strtotime($tgl))];
            $row      = $db->table('jurnal_baca j')
                ->select('COALESCE(SUM(j.durasi_menit),0) AS m')
                ->join('users u', 'u.id = j.siswa_id')
                ->where('u.kelas_id', $kelasId)
                ->where('j.status', 'terverifikasi')
                ->where('j.tanggal', $tgl)
                ->get()->getRowArray();
---
SELECT COALESCE(SUM(j.durasi_menit), 0) AS m
FROM `jurnal_baca` `j`
JOIN `users` `u` ON `u`.`id` = `j`.`siswa_id`
WHERE `u`.`kelas_id` = 1
AND `j`.`status` = 'terverifikasi'
AND `j`.`tanggal` = '2026-10-03'

    public function leaderboardKelas(int $kelasId, int $limit = 10): array
    {
        $db = \Config\Database::connect();
        return $db->table('users u')
            ->select('u.id, u.nama, u.avatar,
                      COUNT(j.id) AS total_jurnal,
                      COALESCE(SUM(j.jumlah_halaman),0) AS total_halaman,
                      COALESCE(SUM(j.durasi_menit),0) AS total_menit,
                      COUNT(DISTINCT j.judul_buku) AS total_buku')
            ->join('jurnal_baca j', 'j.siswa_id = u.id AND j.status = \'terverifikasi\'', 'left')
            ->where('u.role', 'siswa')
            ->where('u.kelas_id', $kelasId)
            ->groupBy('u.id, u.nama, u.avatar')
            ->orderBy('total_halaman', 'DESC')
            ->orderBy('total_jurnal', 'DESC')
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `u`.`id`, `u`.`nama`, `u`.`avatar`, COUNT(j.id) AS total_jurnal, COALESCE(SUM(j.jumlah_halaman), 0) AS total_halaman, COALESCE(SUM(j.durasi_menit), 0) AS total_menit, COUNT(DISTINCT j.judul_buku) AS total_buku
FROM `users` `u`
LEFT JOIN `jurnal_baca` `j` ON `j`.`siswa_id` = `u`.`id` AND `j`.`status` = 'terverifikasi'
WHERE `u`.`role` = 'siswa'
AND `u`.`kelas_id` = 1
GROUP BY `u`.`id`, `u`.`nama`, `u`.`avatar`
ORDER BY `total_halaman` DESC, `total_jurnal` DESC
 LIMIT 32

    public function menungguDiKelas(int $kelasId): array
    {
        return $this->select('jurnal_baca.*, users.nama AS nama_siswa, users.avatar')
            ->join('users', 'users.id = jurnal_baca.siswa_id')
            ->where('users.kelas_id', $kelasId)
            ->where('jurnal_baca.status', 'menunggu')
            ->orderBy('jurnal_baca.tanggal', 'ASC')
            ->findAll();
---
SELECT `jurnal_baca`.*, `users`.`nama` AS `nama_siswa`, `users`.`avatar`
FROM `jurnal_baca`
JOIN `users` ON `users`.`id` = `jurnal_baca`.`siswa_id`
WHERE `users`.`kelas_id` = 1
AND `jurnal_baca`.`status` = 'menunggu'
ORDER BY `jurnal_baca`.`tanggal` ASC

    public function belumMembacaMingguIni(int $kelasId): array
    {
        $db    = \Config\Database::connect();
        $aktif = $db->table('jurnal_baca j')
            ->select('j.siswa_id')
            ->join('users u', 'u.id = j.siswa_id')
            ->where('u.kelas_id', $kelasId)
            ->where('j.status', 'terverifikasi')
            ->where('j.tanggal >=', date('Y-m-d', strtotime('-6 days')))
            ->groupBy('j.siswa_id')
            ->get()->getResultArray();
---
SELECT `j`.`siswa_id`
FROM `jurnal_baca` `j`
JOIN `users` `u` ON `u`.`id` = `j`.`siswa_id`
WHERE `u`.`kelas_id` = 1
AND `j`.`status` = 'terverifikasi'
AND `j`.`tanggal` >= '2026-10-03'
GROUP BY `j`.`siswa_id`

    public function periksaLencana(int $siswaId): array
    {
        $stats    = $this->statistikSiswa($siswaId);
        $lencanaM = model(LencanaModel::class);
        $milikM   = model(UserLencanaModel::class);
        $baru     = [];

        foreach ($lencanaM->findAll() as $l) {
            $nilai = $stats[$l['syarat_tipe']] ?? 0;
            if ($nilai >= (int) $l['syarat_nilai'] && ! $milikM->sudahPunya($siswaId, (int) $l['id'])) {
                $milikM->insert([
                    'user_id'     => $siswaId,
                    'lencana_id'  => $l['id'],
                    'diraih_pada' => date('Y-m-d H:i:s'),
                ]);
---
SELECT *
FROM `lencana`
INSERT INTO `user_lencana` (`user_id`, `lencana_id`, `diraih_pada`) VALUES (3, 1, '2026-10-09 11:41:22')