app/Models/KelasModel.php

    public function denganGuru(): array
    {
        return $this->select('kelas.*, users.nama AS nama_guru')
            ->join('users', 'users.id = kelas.guru_id', 'left')
            ->orderBy('kelas.tingkat', 'ASC')
            ->orderBy('kelas.nama', 'ASC')
            ->findAll();
---
SELECT `kelas`.*, `users`.`nama` AS `nama_guru`
FROM `kelas`
LEFT JOIN `users` ON `users`.`id` = `kelas`.`guru_id`
ORDER BY `kelas`.`tingkat` ASC, `kelas`.`nama` ASC