app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'guru'
 LIMIT 1
---
    public function byUsername(string $username): ?array
    {
        return $this->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `role` = 'siswa'
AND `kelas_id` = 1
ORDER BY `nama` ASC
---
    public function siswaDiKelas(int $kelasId): array
    {
        return $this->where('role', 'siswa')
            ->where('kelas_id', $kelasId)
            ->orderBy('nama', 'ASC')
            ->findAll();