app/Models/UserLencanaModel.php

    public function milikUser(int $userId): array
    {
        return $this->select('lencana.*, user_lencana.lencana_id, user_lencana.diraih_pada')
            ->join('lencana', 'lencana.id = user_lencana.lencana_id')
            ->where('user_lencana.user_id', $userId)
            ->orderBy('user_lencana.diraih_pada', 'ASC')
            ->findAll();
---
SELECT `lencana`.*, `user_lencana`.`diraih_pada`
FROM `user_lencana`
JOIN `lencana` ON `lencana`.`id` = `user_lencana`.`lencana_id`
WHERE `user_lencana`.`user_id` = 3
ORDER BY `user_lencana`.`diraih_pada` ASC

    public function sudahPunya(int $userId, int $lencanaId): bool
    {
        return $this->where('user_id', $userId)->where('lencana_id', $lencanaId)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `user_lencana`
WHERE `user_id` = 3
AND `lencana_id` = 1